Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: དེ་དག་ནི་འདིར་གཏོགས་སོ།
en: They are all included in these.

source: །ས་དང་པོ་ལ་གནས་པ་རྣམས་ནི་ལྷག་པའི་བསམ་པ་དག་པའོ། །ས་བདུན་པའི་བར་དུ་ནི་རྩོལ་བ་དང་བཅས་པར་མཚན་མ་མེད་པ་ལ་གནས་པ་དག་གོ། །ས་བརྒྱད་པ་ནི་མཚན་མ་མེད་པ་ལ་ལྷུན་གྱིས་གྲུབ་པར་གནས་པ་དག་གོ། །དེ་ནས་ས་བཅུ་པའི་བར་དུ་ནི་སྤྱོད་པ་ངེས་པ་ལ་ཞུགས་པ་དག་གོ།
en: Those with a surpassing intention are on the first bodhisattva level; those who stand in signlessness with effort are up to the seventh level; those who effortlessly stand in signlessness are on the eighth level; those who have entered into the certain course of conduct are up to the tenth level; and from then on they are obstructed by just a single birth.

source: །དེ་ཡན་ཆད་ནི་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ་དག་གོ།
en: They are all included in these.

source: །དེ་ལ་གཟུངས་ཐོབ་པ་ཞེས་བྱ་བ་ནི་འཛིན་པར་བྱེད་པས་ན་གཟུངས་ཞེས་བྱའོ།
en: They have acquired the dhāraṇīs. It is a dhāraṇī because it causes them to bear the meaning in mind.

source: །གཟུངས་དེ་ཡང་རྣམ་པ་བཞི་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་བཟོད་པ་འཐོབ་པའི་རྒྱུར་གྱུར་པའི་གཟུངས་དང་། གསང་སྔགས་ཀྱི་གཟུངས་དང་། ཆོས་ཀྱི་གཟུངས་དང་། དོན་གྱི་གཟུངས་སོ།
en: There are four dhāraṇīs: a dhāraṇī that causes bodhisattvas to obtain forbearance, secret mantra dhāraṇī, word or doctrine dhāraṇī, and meaning dhāraṇī.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་བཟོད་པ་ཐོབ་པའི་རྒྱུར་གྱུར་པའི་གཟུངས་གང་ཞེ་ན།
en: What is a dhāraṇī that acts as a cause for bodhisattvas to obtain forbearance?

source: འདི་ལ་སྔོན་གྱི་རྒྱུ་ཕུན་སུམ་ཚོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་མོས་པས་སྤྱོད་པའི་ས་ལ་རབ་ཏུ་དབེན་པར་སྤྱོད་པ། ཟས་ཀྱི་ཚོད་ཤེས་པ། དབང་པོ་བསྡམས་པ་སུ་དང་ཡང་ལྷན་ཅིག་གཏམ་མི་ཟེར་བ། མི་ཉལ་བར་བརྩོན་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བཟོད་པ་བསྐྱེད་པར་བྱ་བའི་ཕྱིར་གསང་སྔགས་ཀྱི་གཞི། ཏདྱ་ཐཱ།
en: Bodhisattvas who have earlier completed the causes on the devoted course of conduct level by always leading a life of isolation, eating in moderation, restraining their senses, not starting up a conversation with just anybody, and trying not to fall off to sleep in order to produce a bodhisattva’s forbearance bear in mind those secret mantra base letters, or words—tadyathā | i ṭi mi ṭi | ki ṭi vi kṣānti | pā da ni svā hā and so on—that they say.

source: ཨི་ཊི་མི་ཊི།
en: They wonder, “What do these secret mantra bases mean?

source: ཀི་ཊི་བི་ཀྵཱནྟི། པཱ་ད་ནི་སྭཱཧཱ། ཞེས་བྱ་བ་གང་དག་གསུངས་པ་དེ་དག་ལས་ཡི་གེ་རྣམས་བཟུང་སྟེ། གསང་སྔགས་ཀྱི་གཞི་འདི་དག་གི་དོན་གང་ཡིན་ཞེས་བརྗོད་པ་དང་བརྗོད་པར་བྱ་བའི་དངོས་པོར་དོན་སེམས་པར་བྱེད་དོ།
en: What are the actual meanings of the expression and what’s expressed?”

source: །དེ་ལྟར་ཡུན་རིང་དུ་བསམས་ཀྱང་བརྗོད་པར་བྱ་བ་དེའི་དོན་མི་མཐོང་ངོ་།
en: After thus contemplating for a long time they see no meaning in what is being expressed.

source: །དོན་མ་མཐོང་བ་དང་འདི་སྙམ་དུ་སེམས་ཏེ་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་གི་བརྗོད་པར་བྱ་བའི་དོན་ནི་གང་ཡང་མེད་ཀྱི།
en: Seeing no meaning, they ascertain perfectly, “There is no meaning at all being expressed in those secret mantra bases.

source: བརྗོད་པར་བྱ་བའི་དོན་མེད་པ་ཉིད་གསང་སྔགས་ཀྱི་གཞི་དག་གི་དོན་ཡིན་དུ་ངེས་ཏེ།
en: It is certain that just the absence of an expressed meaning is the meaning of those secret mantra bases.

source: བརྗོད་པར་བྱ་བའི་དོན་མེད་པའི་རང་བཞིན་ནི་འདི་དག་གི་དོན་ཡིན་ནོ་སྙམ་དུ་ཡང་དག་པར་གཏན་ལ་འབེབས་ཤིང་།
en: The intrinsic absence of an expressed meaning is their meaning.”

source: གསང་སྔགས་ཀྱི་གཞི་འདི་དག་ནི་བརྗོད་པ་དང་བརྗོད་པར་བྱ་བའི་རང་བཞིན་དང་བྲལ་བ་ཡིན་པར་སྒོམ་པར་བྱེད་དོ།
en: They meditate on those secret mantra bases as free from an essential expression and what is expressed.

source: །དེ་ལྟར་བརྗོད་པ་དང་བརྗོད་པར་བྱ་བའི་རང་བཞིན་དང་བྲལ་བའི་གསང་སྔགས་ཀྱི་གཞི་ལེགས་པར་བསྒོམས་ནས་ཡང་དེའི་ཚུལ་གྱིས་ཆོས་ཐམས་ཅད་ཀྱང་བརྗོད་པ་དང་བརྗོད་པར་བྱ་བའི་རང་བཞིན་དང་བྲལ་བ་ཡིན་པར་ཡང་དག་པར་གཏན་ལ་འབེབས་པར་བྱེད་དེ།
en: Having meditated well on those secret mantra bases free from expression and what is expressed, they perfectly ascertain that in the same fashion all dharmas are free from an essential expression and what is expressed.

source: །ཇི་ལྟར་གསང་སྔགས་ཀྱི་གཞི་འདི་རྣམས་བརྗོད་དུ་མེད་པའི་རང་བཞིན་ཡིན་པའི་ཕྱིར་བརྗོད་པར་བྱ་བའི་དོན་གང་ཡང་མེད་པར་དེ་བཞིན་དུ་ཆོས་འདི་དག་ཐམས་ཅད་ཀྱང་བརྗོད་དུ་མེད་པས་དེ་དག་གི་རང་བཞིན་ནི་བརྗོད་དུ་མེད་པ་ཉིད་དོ་སྙམ་ནས་ཆོས་ཐམས་ཅད་ནི་བརྗོད་པ་དང་བརྗོད་པར་བྱ་བའི་རང་བཞིན་དང་བྲལ་བ་ཉིད་དེ་བརྗོད་དུ་མེད་པའི་བདག་ཉིད་དུ་ངེས་པར་བྱེད་དེ།
en: They think, “Just as these secret mantra bases are free from an essential expression and what is expressed, all dharmas are similarly inexpressible, so their basic nature is inexpressible.” Thus, they determine that all dharmas, in their basic nature free from an essential expression and what is expressed, are by nature inexpressible.

source: །དེ་ལྟར་ངེས་པར་བྱས་པ་དང་། ཆོས་ཐམས་ཅད་ནི་ཀུན་བརྟགས་པའི་བདག་ཉིད་ཀྱིས་སྟོང་པ་ཉིད་དུ་མཐོང་ངོ་།
en: When they have determined that, they see that all dharmas are empty of a falsely imagined nature.

source: །དེས་ད་ལྟར་མཐོང་བ་ན་ཆོས་ཐམས་ཅད་བརྗོད་དུ་མེད་པའི་རང་བཞིན་དུ་རབ་ཏུ་རྟོགས་པས་དགའ་བ་དང་། མཆོག་ཏུ་དགའ་བ་ཆེན་པོ་སྐྱེས་ཏེ།
en: When they see that, they realize the essential inexpressible nature of all dharmas, on account of which a great joy arises.

source: དེའི་ཚེ་ན་དེས་གཟུངས་ཐོབ་པ་ཞེས་བྱ་བར་འགྱུར་རོ།
en: Because of that, they are then those who have “acquired the dhāraṇis.”

source: །དེ་ནས་གཟུངས་ཐོབ་པའི་རྒྱུ་དེ་ཉིད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ལ་དེ་མ་ཐག་ཏུ་ས་རབ་ཏུ་དགའ་བའི་ཡེ་ཤེས་སྐྱེ་བ་དང་མཐུན་པའི་བཟོད་པ་ཆེན་པོ་སྐྱེས་ཏེ། དོན་དམ་པའི་ཆོས་རྣམས་ལ་བཟོད་པས་ན་བཟོད་པ་ཞེས་བྱའོ།
en: Then just because of acquiring the dhāraṇīs, with that as the cause, there immediately comes into being for the bodhisattva a great forbearance in harmony with the production of the first Pramuditā level, a forbearance so called because it is able to bear the ultimate.

source: །དེ་ལྟར་བཟོད་པ་སྐྱེས་པ་ལ་གཟུངས་ཀྱི་ཡེ་ཤེས་ཞེས་བྱའོ།
en: Such a forbearance, when it arises, is dhāraṇī knowledge.

source: །གཟུངས་ཀྱི་བཟོད་པ་དེ་སྐྱེས་ནས་རིང་པོ་མི་ཐོགས་པར་ལྷག་པའི་བསམ་པ་དག་པའི་ས་རབ་ཏུ་དགའ་བ་ཞེས་བྱ་བ་ཐོབ་པར་འགྱུར་རོ།
en: Not long after they have produced that dhāraṇī forbearance they reach the Pramuditā level of those with surpassing aspiration.

source: །དེ་ལྟ་བས་ན་གཟུངས་ཀྱི་བཟོད་པ་འདི་ནི་མོས་པས་སྤྱོད་པའི་སར་གཏོགས་པར་རིག་པར་བྱའོ།
en: Therefore, you should know that this dhāraṇī forbearance is included in the devoted course of conduct level.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གསང་སྔགས་ཀྱི་གཟུངས་གང་ཞེ་ན།
en: What is the secret mantra dhāraṇī of bodhisattvas?

source: བྱིན་གྱིས་རློབ་པར་ནུས་པའི་ཏིང་ངེ་འཛིན་གྱི་དབང་གང་ཡིན་པ་དེ་ནི་གསང་སྔགས་ཀྱི་གཟུངས་ཞེས་བྱ་སྟེ།
en: The mastery of meditative stabilization capable of exerting controlling power is secret mantra dhāraṇī.

source: འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བསྐལ་པ་གྲངས་མེད་པ་དང་པོ་ལ་ཡེ་ཤེས་ཀྱི་ཚོགས་ཤིན་ཏུ་ཡོངས་སུ་རྫོགས་པར་བྱ་སྟེ།
en: Thus, bodhisattvas have to accumulate knowledge during the first incalculable eon.

source: བསྐལ་པ་གྲངས་མེད་པ་དེ་འདས་ནས་ས་དང་པོ་ཐོབ་སྟེ།
en: After the passing of that incalculable eon they reach the first level.

source: ས་དེ་ལ་ཡེ་ཤེས་ཤིན་ཏུ་རྣམ་པར་སྦྱངས་པས་ཤིན་ཏུ་ཡོངས་སུ་སྦྱངས་པའི་ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་ལ་སྙོམས་པར་ཞུགས་ནས་དེ་ལ་དབང་ཐོབ་སྟེ། ཏིང་ངེ་འཛིན་གྱི་དབང་གི་སྟོབས་བསྐྱེད་པ་དང་།
en: On that level they engage in the purification for knowledge, and gain mastery over the attainment of practiced meditative stabilizations and absorptions.

source: སྔོན་གྱི་སྨོན་ལམ་གྱི་སྟོབས་བསྐྱེད་པས་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་སེམས་ཅན་རྣམས་ཀྱི་ཡམས་ཀྱི་ནད་དང་། གནོད་པ་དང་། ནད་འགོ་བ་དང་། འཁྲུག་པ་ཐམས་ཅད་ཞི་བར་གྱུར་ཅིག་ཅེས་ཏིང་ངེ་འཛིན་གྱི་དབང་གི་སྟོབས་ཀྱིས་སེམས་ཅན་རྣམས་ཀྱི་ཡམས་ཀྱི་ནད་དང་། གནོད་པ་ཞི་བར་བྱེད་པའི་གསང་སྔགས་ཀྱི་གཞི་རྣམས་བྱིན་གྱིས་རློབ་སྟེ།
en: The force produced by the meditative stabilization faculty and the force produced by earlier prayers exert controlling power over the secret mantra bases, so the force of the meditative stabilization, concentrating on “may these secret mantra bases stop all the plagues, problems, diseases, and strife of beings,” stops plagues and problems.

source: དེས་དེ་ལྟར་བྱིན་གྱིས་བརླབས་པའི་གསང་སྔགས་ཀྱི་གཞི་དེ་དག་གྲུབ་པར་འགྱུར་མཆོག་ཏུ་གྲུབ་པར་འགྱུར་ཞིང་གཏན་དུ་གྲུབ་པར་འགྱུར་རོ།
en: That is the way those secret mantra bases exerting controlling power are accomplished, becoming supreme and solidly efficacious.

source: །དེ་བཞིན་དུ་ས་གོང་མ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཡང་སེམས་ཅན་གྱི་དོན་དེ་དང་། དེ་དག་གི་ཕྱེད་དུ་གསང་སྔགས་ཀྱི་ཚིག་དེ་དག་ཇི་ལྟ་ཇི་ལྟར་བྱིན་གྱིས་བརླབས་པ་དེ་ལྟ་དེ་ལྟར་རྣམ་པ་ཐམས་ཅད་དུ་འགྲུབ་པར་འགྱུར་རོ།
en: Similarly, bodhisattva great beings stationed on the higher levels fully accomplish for the sake of this or that need of beings the secret mantra words exerting controlling power in whatever way necessary.

source: །དེ་ལྟ་བས་ན་ཏིང་ངེ་འཛིན་གྱི་དབང་དེ་ལྟ་བུར་གྱུར་པས་གསང་སྔགས་རྣམས་འཛིན་པར་བྱེད་པས་ན་གསང་སྔགས་ཀྱི་གཟུངས་ཞེས་བྱའོ།
en: Since this is the case, they are “secret mantra dhāraṇīs,” because with such mastery of the meditative stabilization they bear the secret mantras in mind.

source: །གཟུངས་ཀྱི་དབང་དེའི་ཡུལ་དུ་གྱུར་པའི་གསང་སྔགས་ཀྱི་གཞི། དེ་དག་ཀྱང་གཟུངས་ཀྱི་ཡུལ་དུ་གྱུར་པའི་ཕྱིར་གཟུངས་ཞེས་བྱའོ།
en: The secret mantra bases that are objects of those dhāraṇī faculties are also “dhāraṇīs” because they are the objects of those dhāraṇīs.

source: །དེ་ལ་ཆོས་ཀྱི་གཟུངས་གང་ཞེ་ན།
en: Among them, what is doctrine dhāraṇī?

source: འདི་ལ་སར་ཆུད་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལས་ཆོས་ཉན་པ་ན་སྔོན་མི་ཤེས་ཤིང་སྔོན་མ་ཐོབ་པའི་མིང་གི་ཚོགས་དང་། ཚིག་གི་ཚོགས་དང་ཡི་གེའི་ཚོགས་སུ་གཏོགས་པའི་ཆོས་ཚད་མེད་གྲངས་མེད། དཔག་ཏུ་མེད་པ་རྣམས་རིམ་པ་དེ་ཉིད་ཀྱིས་ཡུན་རིང་པོར་ཡང་མི་བརྗེད་པར་འཛིན་པར་དྲན་པ་དང་། ཤེས་རབ་ལ་ཆོས་ཀྱི་གཟུངས་ཞེས་བྱའོ།
en: Doctrine dhāraṇī is the recollection and wisdom that bear in mind and do not forget, even after a long time, the infinite, incalculable, immeasurable doctrines included in the collection of words, the collection of phrases, and the collection of speech sounds that bodhisattvas never understood or heard before, when they have reached the levels and are listening to the doctrines of the buddhas and bodhisattvas.

source: །དེ་ལ་དོན་གྱི་གཟུངས་གང་ཞེ་ན།
en: Among them, what is meaning dhāraṇī?

source: བྱང་ཆུབ་སེམས་དཔའི་དེ་དག་ཉིད་ཀྱིས་དེ་ལྟར་བཟུང་བའི་ཆོས་རྣམས་ཀྱི་དོན་ཚད་མེད། གྲངས་མེད། དཔག་ཏུ་མེད་པ་གང་ཡིན་པ་དེ་དག་དུས་དཔག་ཏུ་མེད་པའི་བར་རབ་ཏུ་ཡང་མི་བརྗེད་པར་འཛིན་པའི་དྲན་པ་དང་། ཤེས་རབ་གཅིག་ཏུ་བྱས་པ་ལ་དོན་གྱི་གཟུངས་ཞེས་བྱའོ།
en: Meaning dhāraṇī is recollection and wisdom, taken as one, that bear in mind and do not forget the infinite, incalculable, immeasurable meanings of the doctrines those bodhisattvas have borne in mind like that for an immeasurable time.

source: །དེ་དག་ལས་བཟོད་པའི་རང་བཞིན་དུ་གྱུར་པའི་གཟུངས་སྔར་བཤད་པ་དེ་ནི་སྔོན་གྱི་རྒྱུ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཀྱི་སྟེ། མོས་པས་སྤྱོད་པའི་ས་ཉིད་ལ་འཐོབ་པོ།
en: Among them, the aforementioned dhāraṇī in the form of forbearance is of those who have earlier completed the causes, so they gain it on the devoted course of conduct level.

source: །གཞན་གཟུངས་གསུམ་པོ་ནི་བསྐལ་པ་གྲངས་མེད་པ་དང་པོ་འདས་ནས་ས་དང་པོ་ལ་སོགས་པ་ལ་འཐོབ་པོ།
en: They gain the remaining three on the first level and so on, having passed beyond the first countless eon.

source: །དེ་ལ་མདོ་ལས་ཀྱང་། ཆོས་བཞི་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་གཟུངས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ། །ཞེས་གསུངས་པའི་ཕྱིར་ཏེ།
en: About them a sūtra says, “Bodhisattva great beings who possess four dharmas are perfect in dhāraṇī.”

source: ཆོས་བཞི་ནི་གཟུངས་འཐོབ་པར་འགྱུར་བའོ།
en: Those who have “acquired the dhāraṇīs” have the four dharmas.

source: །ཆོས་བཞི་ནི་བདག་དང་གཞན་མཉམ་པ་ཉིད་ཀྱི་མི་མཐུན་པའི་ཕྱོགས་སུ་གྱུར་པ་སྟེ། འདི་ལྟར་འདོད་པ་རྣམས་ལ་ལྷག་པར་ཞེན་པ་དང་། ཕྲག་དོག་དང་སེར་སྣ་དང་ཆོས་ཀྱི་ཀུན་དགའ་ལ་མི་དགའ་བའོ། །དེ་ལས་བཟློག་པ་ནི་འདོད་པ་རྣམས་ལ་སྨོད་པ་དང་། ཕྲག་དོག་མེད་པ་དང་། ཐམས་ཅད་གཏོང་བ་དང་། འདི་ལྟ་སྟེ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ལ་བརྩམས་ནས་ཆོས་ལ་དགའ་བའོ་ཞེས་བྱའོ། །དེ་ལ་མདོ་གཞན་ལས་གསུངས་པའི་རིམ་གྱིས་ས་དང་པོ་ལ་ནི་གནས་ཁྱད་པར་དུ་འཕགས་པ་ཞེས་བྱ་བའི་གཟུངས་ཐོབ་པར་འགྱུར་ཏེ།
en: The four dharmas are “disdain for sense objects, absence of envy, giving up everything, and joy in the Dharma in the Bodhisattvapiṭaka and so on, which stop the four on the side opposing the equality of self and others—excessive attachment to sense objects, envy, miserliness, and lack of enthusiasm for the joy of the Dharma.”

source: དེའི་དབང་གིས་དམ་པ་ཁྱད་པར་ཅན་གྱི་ཆོས་ཐམས་ཅད་ཀྱི་གནས་སུ་གྱུར་པ་ཡིན་ནོ། །གཉིས་པ་ལ་ནི་དྲི་མ་མེད་པ་ཞེས་བྱ་བ་སྟེ། དེའི་དབང་གིས་དེར་ཚུལ་ཁྲིམས་རྣམ་པར་དག་པར་འགྱུར་རོ། །གསུམ་པ་ལ་ནི་ཤིན་ཏུ་བརྟན་པ་ཞེས་བྱ་སྟེ། དེའི་དབང་གིས་སེམས་འཁྲུག་པ་ཐམས་ཅད་དང་བྲལ་བ་བཟོད་པའི་སྟོབས་ཕུན་སུམ་ཚོགས་པས་ཤིན་ཏུ་བསྟན་པར་འགྱུར་རོ། །བཞི་པ་ལ་ནི་ཐུབ་པར་དཀའ་བ་ཞེས་བྱ་བ་སྟེ། དེའི་དབང་གིས་བདུད་དང་ཕྱིར་རྒོལ་བ་ཐམས་ཅད་ཀྱིས་མི་ཐུབ་པར་འགྱུར་རོ། །ལྔ་པ་ལ་ནི་ཡོན་ཏན་གྱིས་སེམས་བརྒྱན་པ་ཞེས་བྱ་བའོ། །དྲུག་པ་ལ་ནི་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་གྱི་སྒྲོན་མ་ཞེས་བྱ་བའོ། །བདུན་པ་ལ་ནི་ཁྱད་པར་དུ་འགྲོ་བ་ཞེས་བྱ་བའོ།
en: According to the sequence set forth in another sūtra, on the first level they have acquired the superior location dhāraṇī because through its force they have become a location for all holy, special qualities; on the second, the stainless, because through its force they have pure morality; on the third, the extremely stable, because through its force the perfect power of patience free from all mental disturbances is stabilized; on the fourth, the hard to conquer, because through its force one is unconquerable by all Māras and opponents; on the fifth, the good quality mind ornament dhāraṇī; on the sixth, the lamp for the knowledge maṇḍala; on the seventh, the becoming distinguished; on the eighth, the nonconceptual; on the ninth, the infinitely-doored; and on the tenth, the inexhaustible basket dhāraṇī.

source: །བརྒྱད་པ་ལ་ནི་མི་རྟོག་པ་ཞེས་བྱ་བའོ། །དགུ་པ་ལ་ནི་སྒོ་མཐའ་ཡས་པ་ཞེས་བྱ་བའོ། །བཅུ་པ་ལ་ནི་མི་ཟད་པའི་ཟ་མ་ཏོག་ཅེས་བྱ་སྟེ། དེ་ལྟར་ས་དང་སར་སོ་སོའི་གཟུངས་ལ་སོགས་པ་གཟུངས་ཚད་མེད་གྲངས་མེད་པ་སྟོང་ཕྲག་དུ་མ་ཐོབ་པས་ན་གཟུངས་ཐོབ་པ་ཞེས་བྱ་བ་སྟེ།
en: Hence, they have “acquired the dhāraṇīs” because on each of those different levels they gain a myriad of infinite, incalculable, immeasurable dhāraṇīs.

source: དེའི་ཕྱིར་འདི་ལྟར་མོས་པས་སྤྱོད་པའི་ས་དང་ཡང་ཐུན་མོང་དུ་གྱུར་པས་ཡོན་ཏན་འདི་ལྟར་སྨོས་སོ།
en: Therefore, because such good qualities as these are shared in common with the devoted course of conduct level, it speaks of them like this.

source: །རྣམ་པ་གཞན་དུ་ཡང་འདི་ལ་ཡི་གེ་ཐམས་ཅད་གོམས་པར་བྱས་ན་ཆོས་ཐམས་ཅད་རྟོགས་པའི་རྒྱུར་འགྱུར་ཏེ།
en: Alternatively, when they have become familiar with all the syllables in this perfection of wisdom, they become causes for the realization of all dharmas.

source: འདི་ལྟ་སྟེ་ཆོས་ཐམས་ཅད་ནི་མ་སྐྱེས་པའོ་ཞེས་བྱ་བ་ལ་ཡི་གེའི་དང་པོ་ཨ་ཞེས་བྱ་བ་ལ་སྐྱེ་བ་མེད་པའི་དོན་སྒྲོ་བཏགས་ནས་ཨ་ཞེས་བྱ་བ་ནི་སྐྱེ་བ་མེད་པའི་དོན་ཡིན་པར་ཡོངས་སུ་བཏགས་ཏེ།
en: Thus, a is the first letter in anutpannatva, “nonproduction,” in “all dharmas are unproduced.”

source: གང་གི་ཚེ་ཞི་གནས་དང་ལྷག་མཐོང་གི་སྦྱོར་བས་ཡང་དག་པར་བསྒོམས་པར་གྱུར་པ་དེའི་ཚེ། གོམས་པའི་སྟོབས་ཀྱིས་ཨ་ཞེས་བྱ་བ་གཅིག་གིས་ཆོས་ཐམས་ཅད་སྐྱེ་བ་མེད་པའི་རྣམ་པར་སྣང་སྟེ།
en: When, having superimposed the meaning of nonproduction on the a, bodhisattvas consider that it means nonproduction, and through the practice of calm abiding and special insight their meditation becomes perfect, then just the single letter a appears, through the force of habituation, in the form of the nonproduction of all dharmas.

source: དེ་ལྟར་ན་ཨ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་རྟོགས་པར་བྱ་བའི་རྒྱུ་ཡིན་ནོ།
en: In this manner a is the cause of the realization of all dharmas.

source: །དེ་ལྟར་ཨ་ཞེས་བྱ་བ་དེ་ཉིད་མ་སྐྱེས་པ་དང་། མ་བྱུང་བ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དང་། འགག་པ་མེད་པ་ལ་སོགས་པའི་དོན་ལ་བརྟེན་ཏེ་བསྒོམས་ན་ཆོས་ཐམས་ཅད་སོ་སོར་རྟོགས་པའི་རྒྱུར་འགྱུར་རོ།
en: Thus, when they meditate on just this a based on its meaning of nonproduction, nonorigination, the intrinsic nature of a nonexistent thing, noncessation, and so on, it is the cause of the analytic realization of each dharma.

source: །དེའི་ཕྱིར་འདི་སྐད་དུ་གཟུངས་ཀྱི་སྒོ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: Thus it says, What are the dhāraṇī doors?

source: ཡི་གེ་མཉམ་པ་ཉིད་དང་། སྐད་མཉམ་པ་ཉིད་དང་། ཡི་གེ་སྒོ་ཡིན་པ་དང་། ཡི་གེ་འཇུག་པའོ།
en: The sameness of all letters and syllables, the sameness of all spoken words, the syllable-doors, the syllable-entrances.

source: །ཡི་གེ་སྒོ་དང་། ཡི་གེ་འཇུག་པ་གང་ཞེ་ན།
en: What then are the syllable-doors, the syllable-entrances?

source: ཨ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། གཟོད་མ་ནས་མ་སྐྱེས་པའི་ཕྱིར་རོ། །ར་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། རྡུལ་དང་བྲལ་བའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ལ་སོགས་པ་འོག་ནས་གསུངས་སོ།
en: The syllable a is the door to all dharmas being unproduced from the very beginning (ādy-anutpannatvād); ra is a door to the insight that all dharmas are without dirt (rajas), and so on.

source: །དེ་ལྟར་ཡི་གེ་དེ་དག་ལ་བརྟེན་ནས་ཆོས་ཐམས་ཅད་རྟོགས་པར་བྱེད་པ་ན་དྲན་པ་དང་། ཤེས་རབ་སྐྱེ་སྟེ།
en: Thus, based on those syllables, wisdom and recollection arise that realize all dharmas.

source: དེ་དག་གི་དོན་འཛིན་པས་ན་གཟུངས་ཞེས་བྱའོ།
en: Because they bear the meaning of those in mind they are “dhāraṇīs.”

source: །གཟུངས་དེའི་རྒྱུ་དེ་ལས་སྐྱེས་པ་དེ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་དོན་དམ་པ་ལ་དམིགས་པར་བཟོད་པ་སྟེ།
en: The forbearance that takes the ultimate as its objective support is produced from those dhāraṇīs as its cause.

source: དྲན་པ་དང་ཤེས་རབ་དེ་གཉིས་ལ་བཟོད་པའི་གཟུངས་ཞེས་བྱའོ།
en: Both that recollection and wisdom are called the forbearance dhāraṇī.

source: །ཡང་ཡི་གེ་དེ་དག་ཉིད་སྒྲིམ་པ་ཐམས་ཅད་ཀྱིས་ལེགས་པར་གོམས་པར་བྱས་ནས་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་རྒྱུན་ཆགས་པར་ཤིན་ཏུ་མྱུར་བར་བཤད་པའི་ཆོས་ཀྱི་རྒྱུན་དང་། དེའི་དོན་རྣམས་ཀྱང་ཡང་དག་པར་འཛིན་པའི་རྒྱུར་འགྱུར་ཏེ། མིང་གི་ཚོགས་དང་།
en: Again, when bodhisattvas become very familiar with all the combinations of just those syllables strung together, they become the causes for perfectly bearing in mind the streams of Dharma expounded swiftly and continuously by buddhas and bodhisattvas, and their meanings.

source: ཚིག་གི་ཚོགས་དང་། ཡི་གེའི་ཚོགས་རྣམས་ལ་ཤིན་ཏུ་གོམས་པར་འགྱུར་བས་ན་དྲན་པ་དང་ཤེས་རབ་དེ་ཉིད་ལ་ཆོས་ཀྱི་གཟུངས་དང་། དོན་གྱི་གཟུངས་ཞེས་བྱའོ།
en: When they have become extremely familiar with those collections of words, collections of phrases, and collections of speech sounds, that recollection and wisdom is called doctrine dhāraṇī and meaning dhāraṇī.

source: །ཡང་ཡི་གེ་དེ་དག་ཉིད་བྱང་ཆུབ་སེམས་དཔས་ཡང་དག་པར་བསྒོམས་ནས་ཡིད་བཞིན་གྱི་ནོར་བུ་ལྟ་བུར་དངོས་པོ་ཐམས་ཅད་རབ་ཏུ་སྦྱིན་པར་འགྱུར་ཏེ།
en: Furthermore, when bodhisattvas have perfectly meditated on just those syllables, they bestow everything like a wish-fulfilling gem.

source: འདི་ལྟར་དེ་དག་ནི་སྔོན་གྱི་སྨོན་ལམ་གྱི་མཐུ་དང་། ཏིང་ངེ་འཛིན་གྱི་མཐུས་གནོད་པ་ཐམས་ཅད་ཞི་བར་བྱ་བ་དང་། སྡིག་པ་ཐམས་ཅད་བྱང་བར་བྱ་བའི་ཕྱིར་ཞེས་བྱ་བ་ལ་སོགས་པའི་དགོས་པར་བྱིན་གྱིས་བརླབས་ན་དོན་ཐམས་ཅད་སྒྲུབ་པར་བྱེད་པ་གྲུབ་པར་འགྱུར་ཏེ།
en: Thus, when the force of meditative stabilization and the force of earlier prayers exert sustaining power over those syllables, they become the means to do everything that has to be done—the necessary stopping of all problems and purifying of all wrongs and so on.

source: དེའི་ཚེ་བྱིན་གྱིས་རློབ་པའི་ཤེས་པ་དེ་ཉིད་ལ་གསང་སྔགས་ཀྱི་གཟུངས་ཞེས་བྱའོ།
en: At that time, just that knowledge that exerts sustaining power over the syllables is called secret mantra dhāraṇī.

source: །གཟུངས་དེའི་དམིགས་པར་བྱ་བ་ཡིན་པས་ན་ཡི་གེ་དེ་དག་ལ་ཡང་གཟུངས་ཞེས་བྱ་བར་བརྗོད་དོ།
en: Because they are those dhāraṇīs’ necessary objective supports, the syllables are also called dhāraṇīs.

source: །མན་ནི་ཤེས་པ་ཡིན་ལ། ཏྲ་ཞེས་བྱ་བ་ནི་སྐྱོང་བ་ཡིན་པར་བཤད་པས་ཤེས་པ་དང་། སྙིང་རྗེ་ལ་སྔགས་ཞེས་བྱ་བར་བརྗོད་དོ།
en: The explanation of the man [in mantra] is “knowledge” [from the root man], and the tra is “protect” [from the root trai], so knowledge and compassion are mantra.

source: །དེ་ཉིད་ཀྱི་རྒྱུ་མཐུན་པ་ཡིན་པའི་ཕྱིར་ཡི་གེ་དེ་དག་ལ་ཡང་སྔགས་ཞེས་བྱའོ།
en: The syllables are also mantra because they are in harmony with just them as their cause.

source: །ཡང་མ་རིག་པ་སྤོང་བར་བྱེད་པ་དང་། རིག་པ་སྐྱེད་པར་བྱེད་པའི་ཕྱིར་དེ་ཉིད་ལ་རིག་པ་ཞེས་ཀྱང་བྱའོ།
en: Again, because they eliminate ignorance (avidyā) and produce knowledge, just those are also called knowledge (vidyā).

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གོ་འཕང་གི་གཞི་ཡིན་པའི་ཕྱིར། གཞི་རྣམས་ཞེས་བྱ་སྟེ།
en: They are bases [ādhāraṇī] for the stage of the knowledge of all aspects, hence they are bases.

source: དེ་ལྟ་བས་ན་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་རྣམས་རིག་པའི་གསང་སྔགས་གཞི་རྣམས་ཞེས་བྱ་བའི་མིང་འཐོབ་པོ།
en: And so they get the names dhāraṇī secret mantra bases [mantrādhāraṇī] and vidyā secret mantra bases [vidyādhāraṇī].

source: །དེ་ལ་སྔར་བཤད་པའི་བཟོད་པའི་གཟུངས་གང་ཡིན་པ་དེ་ནི་མོས་པས་སྤྱོད་པའི་ས་ཡོངས་སུ་རྫོགས་པ་ན་མངོན་པར་བརྩོན་པའི་སྟོབས་ཀྱིས་འབྱུང་ངོ་།
en: Among those, bodhisattvas obtain the aforementioned forbearance dhāraṇī through the force of effort when the devoted course of conduct level is completed.

source: །གཟུངས་ལྷག་མ་གསུམ་ནི་སྨོན་ལམ་གྱི་སྟོབས་ཀྱིས་སྐྱེ་བར་འགྱུར་ཏེ།
en: The remaining three dhāraṇīs are produced through the power of prayer.

source: ས་དང་པོ་ལ་དེ་དག་ཆུང་ཡང་བརྟེན་པར་འགྱུར་རོ།
en: On the first level, even though small they are still stable.

source: །དེ་ཡན་ཆད་ནི་གཟུངས་དེ་དག་ཐམས་ཅད་ཀྱང་གོང་ནས་གོང་དུ་མཆོག་ཏུ་ཆེར་སྐྱེ་བར་འགྱུར་ཏེ།
en: From then on, all those dhāraṇīs are produced at a greater and greater level of excellence.

source: དེའི་ཕྱིར་གཟུངས་ཐོབ་པ་ཞེས་གསུངས་སོ།
en: Hence they have “acquired the dhāraṇīs.”

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ཐོབ་པ་དེ་ནི་འཕགས་པ་ས་བཅུ་པ་ལས་བཤད་པའི་རིམ་པས་བྱང་ཆུབ་སེམས་དཔའི་ས་དང་པོ་དང་གཉིས་པ་ལ་སོགས་པ་ལ་འཕགས་པའི་བདེན་པ་རྣམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་རྣམས་ལེགས་པར་བསྒོམས་པའི་རྒྱུས་གང་ཟག་སྟོང་པ་ཉིད་དང་། ཆོས་སྟོང་པ་ཉིད་ལ་ཡང་དག་པར་གནས་པར་འགྱུར་ཏེ།
en: Those bodhisattvas who have acquired the dhāraṇīs, having meditated well on the noble truths and the dependent originations, gradually, on the first and second level and so on as explained in the noble sūtra The Ten Bhūmis, with that as the cause, become dwellers in emptiness of a person and in the emptiness of dharmas.

source: དེ་འདི་ལྟར་སྟོང་པ་ཉིད་དེ་ཡང་ཀུན་ཏུ་འགྲོ་བ་ལ་སོགས་པའི་མཚན་ཉིད་དུ་བཟུང་ནས་བསྒོམས་ན་སྟོང་པ་ཉིད་ཀྱི་རྣམ་པར་ཐར་པའི་སྒོ་སྐྱེ་བར་འགྱུར་རོ། །དེ་སྟོང་པ་ཉིད་ཡོངས་སུ་འདྲིས་ན་ས་དང་ཆུ་དང་། རླུང་དང་། མེ་དང་། ཟླ་བ་དང་། ཉི་མ་དང་།
en: When they have thus grasped and meditated on that emptiness marked as omnipresent and so on, the emptiness gateway to liberation opens.

source: རི་དང་། རྒྱ་མཚོ་དང་། མཚེའུ་དང་། དགོན་པ་དང་། ཕྱོགས་དང་ཡུལ་ལ་སོགས་པའི་དངོས་པོ་སྔོན་ཆོས་ཀྱི་མཚན་མར་སོ་སོར་སྣང་བར་གྱུར་པ་གང་དག་ཡིན་པ་དེ་དག་ཐམས་ཅད་སོ་སོར་སྣང་བར་མི་འགྱུར་གྱི།
en: When they have mastered emptiness, the earlier things such as water, wind, fire, moon, sun, mountains, oceans, lakes, woods, regions, districts, and so on that each appeared separately as a causal sign of a phenomenon, whatever they are, do not appear separately—they appear in the form of signlessness.

source: མཚན་མ་མེད་པའི་རྣམ་པར་སྣང་སྟེ་དེའི་ཚེ་ན་མཚན་མ་མེད་པའི་རྣམ་པར་ཐར་པའི་སྒོ་སྐྱེ་བར་འགྱུར་རོ།
en: At that point the signlessness gateway to liberation opens.

source: །དེ་ལྟར་མཚན་མ་ཐམས་ཅད་དང་བྲལ་ནས་མཚན་མ་མེད་པའི་སྒོར་གནས་པ་དེ་ལ་ཁམས་གསུམ་པ་ཐམས་ཅད་ཁམས་གསུམ་གྱི་རྣམ་པར་མི་སྣང་སྟེ། དེ་ནི་དེ་ལ་འདོད་པ་ཅི་ཡང་མི་སྐྱེའོ།
en: For those who thus dwell in the gateway of signlessness free from all causal signs there is no appearance of all three realms as three realms, and they do not desire anything there.

source: །འདོད་པ་མེད་པའི་ཕྱིར་དེ་ནི་དེ་ལ་ཡིད་ཀྱིས་གང་དུ་ཡང་སྨོན་པ་མེད་དོ། །དེའི་ཚེ་དེ་ལ་སྨོན་པ་མེད་པ་ཞེས་བྱ་བའི་རྣམ་པར་ཐར་པའི་སྒོ་སྐྱེ་བར་འགྱུར་རོ།
en: Free from any desire for these, they do not wish for them in their minds, at which point the wishlessness gateway to liberation opens for them.

source: །དེས་དེ་ལྟར་སྟོང་པ་ཉིད་ཀྱི་རྣམ་པར་ཐར་པའི་སྒོ་བཟུང་སྟེ་བསྒོམས་ན་སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་ལ་གནས་པར་འགྱུར་རོ།
en: When they have thus taken up in meditation the emptiness door to liberation, they dwell in the emptiness meditative stabilization.
